{
  "EXPERIENCES": {
    "HEADER": "Experiências",
    "COMPANY_VON_BRAUN_1": "Centro de Pesquisas Avançadas Wernher von Braun",
    "POSITION_TRAINEE": "Pesquisador de Inovação Trainee",
    "DURATION_VON_BRAUN_1": "Janeiro 2025 - Atual",
    "TASK_1_VON_BRAUN_1": "Desenvolvimento de aplicações web escaláveis com atualização em tempo real via WebSockets, utilizando Angular 20 e TypeScript.",
    "TASK_2_VON_BRAUN_1": "Transformação do fluxo de criação de painéis ao substituir um processo manual e fragmentado por um sistema drag-and-drop integrado a sensores, com componentes padrão e suporte a personalização, permitindo montagem direta na aplicação.",
    "TASK_3_VON_BRAUN_1": "Garantia da qualidade do código por meio de testes unitários e E2E (Jest e Cypress), assegurando cobertura total das funcionalidades críticas.",
    "COMPANY_VON_BRAUN_2": "Centro de Pesquisas Avançadas Wernher von Braun",
    "POSITION_INTERN": "Pesquisador de Inovação Estagiário",
    "DURATION_VON_BRAUN_2": "Abril 2024 - Janeiro 2025",
    "TASK_1_VON_BRAUN_2": "Desenvolvimento de websites integrando bibliotecas de gráficos e WebSockets para visualização de dados em tempo real, utilizando Angular 19 e TypeScript.",
    "TASK_2_VON_BRAUN_2": "Implementação de dashboard em tempo real para monitorar o processamento de arquivos do S3, com progresso por etapa e logs detalhados, diminuindo o tempo para diagnóstico e correção de falhas.",
    "TASK_3_VON_BRAUN_2": "Criação de testes automatizados (unitários e E2E) garantindo redução de bugs em produção e maior confiabilidade do front-end.",
    "COMPANY_PET_UFSCAR": "PET BCC - UFSCar",
    "POSITION_FULLSTACK": "Desenvolvedor Full-stack",
    "DURATION_PET_UFSCAR": "Março 2022 - Abril 2024",
    "TASK_1_PET_UFSCAR": "Desenvolvimento de um sistema mobile com a função integrar todos os PETs do Brasil para facilitar o cadastro de atividades. Tecnologias: React Native e Flutter.",
    "TASK_2_PET_UFSCAR": "Desenvolvimento de um jogo de tabuleiro no formato 9x11, com movimentos semelhantes ao Xadrez, mas com diferentes possibilidades. Tecnologias: JavaScript e Python."
  },
  "NAVBAR": {
    "HOME": "Início",
    "PROJECTS": "Projetos",
    "ABOUT": "Sobre",
    "CONTACT": "Contato"
  },
  "HOME_PAGE": {
    "GREETING_NAME": "Olá, eu sou Thiago Albino,",
    "GREETING_ROLE": "Desenvolvedor Frontend",
    "DESCRIPTION": "Sou um Desenvolvedor Frontend apaixonado por criar experiências web envolventes e intuitivas. Tenho a satisfação de transformar designs em interfaces funcionais e responsivas, utilizando, principalmente, Angular e Typescript. Meu objetivo é trazer ideias à vida, garantindo que cada site seja não apenas bonito, mas também rápido e acessível para todos os usuários.",
    "DOWNLOAD_CV": "Download CV",
    "PROFILE_IMAGE_ALT": "Foto de perfil"
  },
  "SKILLS": {
    "HEADER": "Habilidades",
    "PROGRAMMING_LANGUAGES_TITLE": "Linguagens de Programação",
    "TOOLS_TITLE": "Ferramentas",
    "ICONS": {
      "HTML5_ALT": "Ícone de HTML5",
      "CSS3_ALT": "Ícone de CSS3",
      "JAVASCRIPT_ALT": "Ícone de JavaScript",
      "TYPESCRIPT_ALT": "Ícone de TypeScript",
      "ANGULAR_ALT": "Ícone de Angular",
      "NODEJS_ALT": "Ícone de Node.js",
      "JEST_ALT": "Ícone de Jest",
      "CYPRESS_ALT": "Ícone de Cypress",
      "GITHUB_ALT": "Ícone de GitHub",
      "FIGMA_ALT": "Ícone de Figma",
      "VSCODE_ALT": "Ícone de VS Code",
      "GIT_ALT": "Ícone de Git"
    }
  },
  "ABOUT_ME": {
    "HEADER": "Sobre mim",
    "BOOTCAMP_TITLE": "Bootcamp (2023-2024)",
    "BOOTCAMP_TEXT": "Também concluí o bootcamp Santander Coders, oferecido pela Ada Tech em parceria com o Santander, com foco em desenvolvimento front-end com Angular e introdução a Node.js.",
    "UNIVERSITY_TITLE": "Faculdade (2019-2025)",
    "UNIVERSITY_TEXT": "Sou graduado em Ciência da Computação pela UFSCar, concluindo o curso com média geral de 8.32. Durante a graduação, participei de projetos acadêmicos e de extensão, como o Projeto de Educação Tutorial (PET), no qual desenvolvi sistemas mobile e colaborei na criação de um jogo de tabuleiro digital utilizando JavaScript.",
    "EXPERIENCE_TITLE": "Experiência (2024-Atual)",
    "EXPERIENCE_TEXT": "Atuo no Centro de Pesquisas Von Braun Labs, onde participo da construção de aplicações web escaláveis, sendo responsável pela arquitetura do front-end e pela implementação de testes unitários e end-to-end.",
    "STUDIES_TITLE": "Estudos",
    "STUDIES_TEXT": "Atualmente busco me aprofundar nas novidades do Angular e expandir meus conhecimentos no back-end com C# e .NET, visando me tornar um desenvolvedor ainda mais completo."
  },
  "CONTACT": {
    "HEADER": "Entre em contato",
    "EMAIL_TITLE": "Email",
    "SOCIAL_MEDIA_TITLE": "Redes Sociais",
    "FORM_HEADER": "Formulário de contato",
    "FORM_NAME_LABEL": "Nome",
    "FORM_EMAIL_LABEL": "Email",
    "FORM_MESSAGE_LABEL": "Mensagem",
    "FORM_NAME_ERROR": "Por favor, insira seu nome!",
    "FORM_EMAIL_ERROR": "Por favor, insira um email válido!",
    "FORM_MESSAGE_ERROR": "Por favor, insira sua mensagem!",
    "FORM_SUBMIT_BUTTON": "Enviar"
  },
  "PROJECTS": {
    "HEADER": "Últimos projetos",
    "PROJECT_TITLE_PLACEHOLDER": "Título do projeto",
    "PROJECT_DESCRIPTION_PLACEHOLDER": "Descrição do projeto",
    "VIEW_PROJECT_BUTTON": "Ver projeto",
    "GITHUB_BUTTON": "Github",
    "IMAGE_ALT_PLACEHOLDER": "Imagem do projeto"
  },
  "FOOTER": {
    "COPYRIGHT": "© 2025 Thiago Albino — Todos os direitos de design e desenvolvimento reservados."
  }
}
